{"videos": ["https://www.youtube.com/embed/XuBdXVj2hn8?ps=play&vq=large&rel=0&autohide=1&showinfo=0&autoplay=1"], "appName": "eWeather HD&Radar&Alert&Quakes", "reviewers": 13647, "refreshDate": 1428315579077, "descriptionHTML": "This is the first app in the world with radar, hurricane tracking, earthquakes and alerts widgets.<p>For those who want to know everything about the weather conditions and alerts both for today and the next 10 days, the past 365 days, hurricanes, tornadoes, hurricanes, earthquakes, geomagnetic storms. </p><p>App has  twenty original widgets of the weather, radar, earthquakes, alerts, moon phase, barometer, geomagnetic index, UV index, rain and snow amount etc.</p><p>Annual archives of air temperature and sea for any city in the world allows you to choose the good time and place for the travel. You can compare the weather in the current year with the weather in the last year. Also you can always have your own opinion about the statements that has never was so cold, hot, wet, dry.</p><p>Features:<br>• Two world-renowned weather providers: Foreca and US weather provider,<br>• Hi-Def, Real-Time animated NOAA (NEXRAD) Radar on Google maps (USA only),<br>• Hurricane tracking,<br>• 365 days weathre archive,<br>• Solstice, Equinox, Polar night, Polar day, Solar eclipse, Lunar eclipse<br>• Sea surface temperature on weather map, widgets, noification area,<br>• Barometer with headache indicator,<br>• Beautiful animation,<br>• Cloud satellite layer on map (USA, Europe, Japan and Australia),<br>• 130,000 locations all over the world,<br>• Twenty original widgets of the weather,  radar, time, moon phase, barometer, geomagnetic index, and UV index (1x1, 2x1, 2x2, 1x4, 4x1, 4x2, 3x3, 4x4, 5x2, 5x5 etc),<br>• Widgets for lockscreen was added (only for Android 4.2)<br>• 126 weather alert categories.<br>• Radar widget on OpenStreetMap (for USA only),<br>• Ten day forecast,<br>• Ten notification indicators in the status bar: temperature, moon phase, earthquakes, alerts, barometer etc,<br>• Earthquakes widget on OpenStreetMap,<br>• Weather Alerts (Advisory, Watch, or Warning) from NOAA (National Oceanic and Atmospheric Administration);<br>• Black ice and freeze warnings,<br>• One-hundred latest earthquakes in the world on Google map,<br>• Pressure forecast graph (Foreca only),<br>• Moon phase, moon rise and moon set times,<br>• Sunrise and sunset times,<br>• Duration of the day,<br>• World map with weather alerts, weather, earthquakes and local time.<br>• Geomagnetic storm forecast,<br>• Wind speed and directionality indicators in both 10-day and hour-by-hour forecasts (except Foreca),<br>• 24 hour by hour forecast,<br>• Current weather conditions,<br>• Only uses 10 KBytes of internet traffic per city for each weather update,<br>• World clock,<br>• METAR from weather station (except Foreca),<br>• UV index,<br>• Visibility on the roads,<br>• Dew point hour by hour graph;<br>• Precipitation probability,<br>• Precipitation amount: rainfall and new snowfall amount,<br>• Follow by location (uses GPS or Cell Network location determination),<br>• Full tablet support,<br>• Share forecast, alerts, earthquakes by e-mail and SMS<br>• Alarm clock time on clock dial and graph</p><p>eWeather HD: <br>• Has a built-in barometer. A diagram is displayed which shows the atmospheric pressure changes for the past 24 hours. A red warning display is produced when the barometer detects changes more than 0.2 inhg.<br>• Provides information on the last 100 earthquakes from all over the world. View the latest earthquakes in a list or on a map. Provides information regarding magnitude, time and distance. You can filter earthquakes by their magnitude and distance from your location</p><p>The most unique feature in this application is the “Weather Clock”. It provides all of the previous information in an hour-by-hour clock format and is very interactive.</p><p>Payment is one time, no ads, no any in-app payment, free updates.</p><p>If you have ANY questions, there is an FAQ section that takes you directly to the website. If your question is specific to your customized set up, customer service is courteous, knowledgeable, willing and able to help with fast turn around time.</p><p></p><p></p><p></p><p></p><p></p><p></p><p></p>", "logo": "https://lh6.ggpht.com/Th8owvawRC7sA3t5zZlUuTV5CK_1yAuRFvtODXT4pZFEvsKEurSZA7Ob1irUipCRIE0=w300", "developer": "Elecont software", "category": "Weather", "additionalInfo": [{"datePublished": "February 6, 2015"}, {"fileSize": "9.6M"}, {"numDownloads": "100,000 - 500,000"}, {"softwareVersion": "5.5.7"}, {"operatingSystems": "1.6 and up"}, {"contentRating": "Low Maturity"}], "score": "4.7", "packageID": "com.Elecont.WeatherClock", "inAppPurchases": false, "topReviews": [{"score": 5, "authorName": "A Google User", "reviewText": " Every information we need is there.  The presentation is beautiful and easy to understand.  Data presented is accurate.  Customer service is the best I've ever seen.  If you want a quality weather app, this is the one to get. I recomend it to all.   ", "reviewTitle": "Very good, very professional", "reviewDate": "February 6, 2015"}, {"score": 3, "authorName": "A Google User", "reviewText": " Was best Wx app w/vast data set. Many modes, pressure graph (great for migraine victims), hi-def radar, global quake tracker, alerts, more.   But ugly screens. BUT no simple time/wx widget. Too much info in tiny area for adult eyes.  Full view confuses hourly wx with daily wx for next few days. More confusing when tapping an area switches view in unexpected manner. Reluctantly replaced it with simpler Time & Weather widget. Add pretty widget w/large clock+wx for higher rating. Check popular apps re examples   ", "reviewTitle": "Was 4.5* but data bloat makes it 3*", "reviewDate": "March 14, 2015"}, {"score": 5, "authorName": "Nicholas Freedman", "reviewText": " It isn't simple but has a deep range of information and options. Combined with the best earthquake alerts (critical for tsunami warning where I live) I just keep going back to this. Worth the money. A design refresh (material design?) would be welcome but isn't important.   ", "reviewTitle": "Superior weather app", "reviewDate": "February 6, 2015"}, {"score": 5, "authorName": "Lloyd Landis", "reviewText": " Thank you developers et al...  Ive been with yall for a year and half. I paid a few precious dollars in hoping that I'm investing in an app that's beneficial and user friendly. You have really been impressive with your useful updates. TO THE BUYER -  THIS SHOULD BE THE NUMBER 1 WEATHER - N-SUCH APP YOU USE! I recommend this app highly. Again thanks for the useful informative updates!   ", "reviewTitle": "Amazing HD weather app", "reviewDate": "February 6, 2015"}, {"score": 5, "authorName": "Adam Brenner", "reviewText": " Up to the minute accurate information. Well organized display and tons of great features with the ability to customize the app to meet any need. Looks clean and functions seamlessly on my S5. Highly recommended.   ", "reviewTitle": "The only weather app you will ever need!", "reviewDate": "February 7, 2015"}, {"score": 5, "authorName": "Billy Dossett", "reviewText": " This app is the best combination of useful and relevant information and visual appeal of any weather app I've tried, and I've tried many. With attractive, readable widgets, an attractive interface with lots of customization, accurate, relevant updates and weather Info and a choice of radar views I highly recommend this for anyone who follows weather closely and wants something easy on the eyes. The developer is also very responsive to questions and issues.   ", "reviewTitle": "Best weather app I've used", "reviewDate": "March 3, 2015"}, {"score": 5, "authorName": "Moe Man", "reviewText": " But this one, as far as I'm concerned is the best out there. Accurate-Yep. Customizable-Yep. Full of more details than I'd know what to do with-Yep..... That's a good thing.  When first installed, it seemed a little overwhelming, but with a little patience I got the hang of it. There's alot of options in there that are well worth spending some time on.   I had some questions at first that were answered very quickly. That kind of cutomer service is outstanding. I've sent questions to some other paid app developers which must have ended up in a black hole somewhere because I never got a response,,,,, just a receipt.....We all know the initials that describe that kind of customer service.  If you want the best weather app out there, spend five bucks, take your time and be happy,,,,, it's that easy.   ", "reviewTitle": "Tried this one and compared a bunch of others,,,,,", "reviewDate": "March 10, 2015"}, {"score": 5, "authorName": "iaman android", "reviewText": " Never thought an app could be so full of great information laid out in such an intelligent fashion. And now to come up with even more functionality is just remarkable. Love it   ", "reviewTitle": "Good stuff!", "reviewDate": "February 9, 2015"}, {"score": 5, "authorName": "Danny Roque", "reviewText": " Amazing superb extravaganza fantastic the best weather widgets app that I've ever tried. It works perfectly fine. great job thanks.   ", "reviewTitle": "Wow awesome weather widgets", "reviewDate": "March 1, 2015"}, {"score": 5, "authorName": "david chauvin", "reviewText": " Best weather app I have ever used. Had a problem with incorrect location on GPS. A support email was answered in a few hours with the problem fixed. This kind of support alone is worth five stars.   ", "reviewTitle": "Great app, great support", "reviewDate": "February 9, 2015"}, {"score": 5, "authorName": "Keith Derr Sr", "reviewText": " 2-25-15 Trying this app again. They have made improvements! Will update after some time to see how it goes! Like the changes so far! GPS is much better now!   ", "reviewTitle": "Motorola DROID ULTRA 4.4.4", "reviewDate": "February 25, 2015"}, {"score": 5, "authorName": "senormom", "reviewText": " It can be as simple or as detailed as you want it. It provides so much information you can spend hours in it. Try it, but don't forget to play with/use it before you give a bad review. I am a farmer so the weather is VERY important to me. I need to know what to do with my crops and animals depending on the weather. This app helps me decide and gives me the information in time to act.   ", "reviewTitle": "The best", "reviewDate": "February 13, 2015"}, {"score": 5, "authorName": "Ligh Tracker", "reviewText": " The most comprehensive,well thought out, stable and eye appealing combo weather, e quake and early warning system out there. Add to that the quick response I received from the Dev ( 2hrs.) for an email question I asked-I'm finished looking for a similar program...if you can find one. Also has sharp hi def radar and   a myriad of ways to tweak everything. Thanks for your dedication to putting out quality.  LG G3/KitKat 4.42   ", "reviewTitle": "Best of the Best", "reviewDate": "March 3, 2015"}, {"score": 5, "authorName": "Ed Myer", "reviewText": " Awesome app, especially considering the amount of work that has gone into it. Love the updated weather stats you can put onto the notification bar.   ", "reviewTitle": "Great for weather buffs.", "reviewDate": "February 7, 2015"}, {"score": 5, "authorName": "Karla McCormick", "reviewText": " I use several weather widgets for various reasons but this one has the most options by far.  I use several of these widgets. It's really amazing! I would tweak some here and there but the app is definitely worth 5 stars...and your $. Update 2/14/15: This app keeps getting better. The capabilities and widget options are amazing!  I can't believe this isn't mentioned in weather app comparisons. It doesn't seem too complicated yet provides everything weather.   ", "reviewTitle": "Most widget options!", "reviewDate": "February 14, 2015"}, {"score": 2, "authorName": "Sidd Gould", "reviewText": " NOW Temperature for each of ten DAYs are missing . ONLY GRAPHICS ARE PRESENT!? Alerts sound working then stops and refuses to work! I don't get any sound on my phone from alerts!? How do you get the alert to make some type of sound audible?   ", "reviewTitle": "No support! Can't  understand their English Alerts and alert filter", "reviewDate": "February 26, 2015"}, {"score": 5, "authorName": "Howard Parker", "reviewText": " Simply the best APP for weather,no other compares! Been using all year simply brilliant! Still using feb 2015.thanks for the super updates! If you need a serious weather app buy it! In reality its worth £££££S   ", "reviewTitle": "eWeather HD Barometer Alerts", "reviewDate": "February 25, 2015"}, {"score": 5, "authorName": "Lyndon Castonguay", "reviewText": " Without a doubt the BEST and most informative weather app. on the market, There's not one single thing I can think of that's missing. Thank you to all involved in the making of this app.   ", "reviewTitle": "EXCELLENCE Very Professional", "reviewDate": "April 3, 2015"}, {"score": 5, "authorName": "Greg Jackson", "reviewText": " All the information you will ever need. The archive function is bada$§ too.   ", "reviewTitle": "Best weather app. Bar none!", "reviewDate": "February 8, 2015"}, {"score": 5, "authorName": "Cosmin Nahaiciuc", "reviewText": " Unequaled amount of USEFUL information, plus the level of configuration is simply unmatched. With every release you'd thing nothing else could make it better - until the next update when they prove you wrong. The developers are great in every regard: questions, support, suggestions, bugs all are addressed fast, courteously and professionally. I've been using it for over 3 years and although I've been trying lots of alternatives none could even come close. Highly recommended!   ", "reviewTitle": "The BEST weather app - an absolute must have!", "reviewDate": "February 6, 2015"}, {"score": 5, "authorName": "Graham Miles", "reviewText": " I'm very very impressed with this weather app. It seems to be the most accurate and certainly the most complete weather reporting I have seen. Thank you very very much for the work you put into it as iI use it all the time. Good luck in your future endeavours.   ", "reviewTitle": "Retired amateur scientist", "reviewDate": "March 15, 2015"}, {"score": 5, "authorName": "Daniel Cherry", "reviewText": " I have purchased this app. Never any issues.   ", "reviewTitle": "Never had a problem!", "reviewDate": "February 16, 2015"}, {"score": 4, "authorName": "Chris Stockman", "reviewText": "Used to be on spot. Now different info on different pages. Says cloudy. It is snowing and raining. For example.   ", "reviewTitle": "", "reviewDate": "March 5, 2015"}, {"score": 5, "authorName": "Liam Patterson", "reviewText": " Well this weather app has it all! It's my go to for in depth weather results.   ", "reviewTitle": "Fantastic", "reviewDate": "February 6, 2015"}, {"score": 4, "authorName": "Sheila Tulumello", "reviewText": " I've had one similar to this before but I like this one better. the only thing I really don't like is the animated pictures for the sun rain etc. It is the most accurate app that I've used so far I highly recommend it   ", "reviewTitle": "Love this app!", "reviewDate": "March 21, 2015"}, {"score": 5, "authorName": "A Google User", "reviewText": " I have two suggestions,   1. Would be possible to do where it updates when you unlock the phone without waiting 10 minutes for it to update  2. Would it be possible to add the precipitation amount when using the U.S. provider (Intellicast)?   ", "reviewTitle": "One of the best apps, I have bought & Recommend", "reviewDate": "March 23, 2015"}, {"score": 5, "authorName": "Eduardo Rodriguez", "reviewText": " I've loved this app for many many many years (well, two) Install and purchase!   ", "reviewTitle": "Many years", "reviewDate": "February 15, 2015"}, {"score": 5, "authorName": "Joshphone2013 W", "reviewText": "This app is very user friendly. I really enjoy the up to date weather information, moon phases, and other helpful weather updtaes. If you purchase any app, make this your first choice when it comes to weather. I have been with this app for years, and I cant leave home without it.   ", "reviewTitle": "", "reviewDate": "April 2, 2015"}, {"score": 5, "authorName": "A Google User", "reviewText": " Really wish click on clock would open alarm rather than small icon in corner!   ", "reviewTitle": "Not bad", "reviewDate": "March 21, 2015"}, {"score": 5, "authorName": "John Green", "reviewText": " With so many different weather features and great widgets, I don't see how any other weather app can top this. If you have a question, the dev responds back in a timely fashion, which I appreciate. Keep up the great work, guys!   ", "reviewTitle": "Great work as usual!", "reviewDate": "February 8, 2015"}, {"score": 4, "authorName": "chris garcia", "reviewText": " This app has everything i need to be kept up to date with the weather in my area.   ", "reviewTitle": "I like it!!!", "reviewDate": "February 16, 2015"}, {"score": 5, "authorName": "Trina P", "reviewText": "Great! No better weather app than this one.   ", "reviewTitle": "", "reviewDate": "February 6, 2015"}, {"score": 5, "authorName": "Michael fees", "reviewText": " Best weather app that I have seen.I have tried many this is the most up todate weather reporting. I use it for my travel .   ", "reviewTitle": "Noaa weather", "reviewDate": "March 18, 2015"}, {"score": 5, "authorName": "PC Guam", "reviewText": " The best radar weather tracking, by far, in my humble opinion. It even tracks hurricanes via radar.   ", "reviewTitle": "The best", "reviewDate": "February 14, 2015"}, {"score": 5, "authorName": "Fog Gy", "reviewText": " Fantastic app but lags pretty badly on note 4 snapdragon when changing screens, I've tried all the settings but no change. Edit..still lags alot when swiping from screen to screen, still a great update though but I would like to be able to get an alert when it rains(any type of rain even light rain), apart from the problems mentioned this is the perfect app for me.   ", "reviewTitle": "Easily worth the cash", "reviewDate": "February 6, 2015"}, {"score": 5, "authorName": "Mandy Clark", "reviewText": " I love this app .. thank you x   ", "reviewTitle": "Dear sergey YOU ROCK", "reviewDate": "April 2, 2015"}, {"score": 5, "authorName": "Lynne Harvey", "reviewText": "I am a migraineur and the barometric pressure widget helped to realise that steep changes up or down trigger migraines in me. For this alone, I am grateful. Thank you   ", "reviewTitle": "", "reviewDate": "February 9, 2015"}, {"score": 5, "authorName": "Nicholas Hall", "reviewText": " I really like the app as it looks good and gives me plenty of info. I did have a licencing issues, which was quickly resolved by Elecont software (thank you for the quick response).  I am a VERY happy chappy :)  Nik   ", "reviewTitle": "Great app, great service :)", "reviewDate": "February 23, 2015"}, {"score": 5, "authorName": "Sebastian Hancock", "reviewText": "Simply the best, full of the info I like . A huge range of info at my fingertips.   ", "reviewTitle": "", "reviewDate": "March 1, 2015"}, {"score": 5, "authorName": "dan weinberg", "reviewText": " This is a must have app for anyone that is into weather. The 4.99 is a more then fair price for all the info you get. The closest one that I know of will run you anywhere from 30. A month to as much as 99.00 a month and you still won't get this amount of info. And please don't complain about using it on a smaller screen  smaller than 5 inches. It is still worth it. Just remember all the info your get. :-D   ", "reviewTitle": "Best weather app and customer service", "reviewDate": "March 25, 2015"}], "description": "This is the first app in the world with radar, hurricane tracking, earthquakes and alerts widgets.For those who want to know everything about the weather conditions and alerts both for today and the next 10 days, the past 365 days, hurricanes, tornadoes, hurricanes, earthquakes, geomagnetic storms. App has  twenty original widgets of the weather, radar, earthquakes, alerts, moon phase, barometer, geomagnetic index, UV index, rain and snow amount etc.Annual archives of air temperature and sea for any city in the world allows you to choose the good time and place for the travel. You can compare the weather in the current year with the weather in the last year. Also you can always have your own opinion about the statements that has never was so cold, hot, wet, dry.Features:• Two world-renowned weather providers: Foreca and US weather provider,• Hi-Def, Real-Time animated NOAA (NEXRAD) Radar on Google maps (USA only),• Hurricane tracking,• 365 days weathre archive,• Solstice, Equinox, Polar night, Polar day, Solar eclipse, Lunar eclipse• Sea surface temperature on weather map, widgets, noification area,• Barometer with headache indicator,• Beautiful animation,• Cloud satellite layer on map (USA, Europe, Japan and Australia),• 130,000 locations all over the world,• Twenty original widgets of the weather,  radar, time, moon phase, barometer, geomagnetic index, and UV index (1x1, 2x1, 2x2, 1x4, 4x1, 4x2, 3x3, 4x4, 5x2, 5x5 etc),• Widgets for lockscreen was added (only for Android 4.2)• 126 weather alert categories.• Radar widget on OpenStreetMap (for USA only),• Ten day forecast,• Ten notification indicators in the status bar: temperature, moon phase, earthquakes, alerts, barometer etc,• Earthquakes widget on OpenStreetMap,• Weather Alerts (Advisory, Watch, or Warning) from NOAA (National Oceanic and Atmospheric Administration);• Black ice and freeze warnings,• One-hundred latest earthquakes in the world on Google map,• Pressure forecast graph (Foreca only),• Moon phase, moon rise and moon set times,• Sunrise and sunset times,• Duration of the day,• World map with weather alerts, weather, earthquakes and local time.• Geomagnetic storm forecast,• Wind speed and directionality indicators in both 10-day and hour-by-hour forecasts (except Foreca),• 24 hour by hour forecast,• Current weather conditions,• Only uses 10 KBytes of internet traffic per city for each weather update,• World clock,• METAR from weather station (except Foreca),• UV index,• Visibility on the roads,• Dew point hour by hour graph;• Precipitation probability,• Precipitation amount: rainfall and new snowfall amount,• Follow by location (uses GPS or Cell Network location determination),• Full tablet support,• Share forecast, alerts, earthquakes by e-mail and SMS• Alarm clock time on clock dial and grapheWeather HD: • Has a built-in barometer. A diagram is displayed which shows the atmospheric pressure changes for the past 24 hours. A red warning display is produced when the barometer detects changes more than 0.2 inhg.• Provides information on the last 100 earthquakes from all over the world. View the latest earthquakes in a list or on a map. Provides information regarding magnitude, time and distance. You can filter earthquakes by their magnitude and distance from your locationThe most unique feature in this application is the “Weather Clock”. It provides all of the previous information in an hour-by-hour clock format and is very interactive.Payment is one time, no ads, no any in-app payment, free updates.If you have ANY questions, there is an FAQ section that takes you directly to the website. If your question is specific to your customized set up, customer service is courteous, knowledgeable, willing and able to help with fast turn around time.", "whatsNewHTML": " <h1 class=\"heading\"> What's New </h1> <div class=\"recent-change\">- Hurricane tracking</div><div class=\"recent-change\">- Alarm clock time on clock dial and graph</div><div class=\"recent-change\">- Weather archive for month</div><div class=\"recent-change\">- Weather alert categories with different sounds and silent mode at night</div><div class=\"recent-change\">- Send weather alerts by SMS</div><div class=\"recent-change\">- Solstice, Equinox, Polar night, Polar day, Solar eclipse, Lunar eclipse</div><div class=\"recent-change\">- Backup and restore app settings</div><div class=\"recent-change\">- New 10-day graph modes</div><div class=\"recent-change\">- Time to sunrise or sunset</div><div class=\"recent-change\">- Wind gust</div><div class=\"recent-change\">- Click on yellow and blue points for display sunset, sunrise and day length</div><div class=\"recent-change\">- Inverse rotation of the seconds hand for joke</div> <div class=\"show-more-end\"></div> <div> <button class=\"play-button show-more small\"> Read more </button> <button class=\"play-button expand-close\"> <div class=\"close-image\"> </div> </button> </div> ", "price": "$4.99", "playStoreUrl": "https://play.google.com/store/apps/details?id=com.Elecont.WeatherClock", "permissions": [], "thumbnails": ["https://lh3.ggpht.com/rmxhnq90ADdiwcX70yP8jCtX5LsRsCKmQ90mAf84CYC7p5Ba3C9ju1XoEheU28HN7w=h310", "https://lh3.ggpht.com/O0822yRKxQxInUec0jLJ0dur7DY-Hembr4wGkilFD166QSGlnvaCUMRXhEJ2LlcopxM=h310", "https://lh6.ggpht.com/Ff4l4ZVodGbtcAmg8JbfziVew1-s-ga_UbicZ2Gg0tz8DwupMUqfCQTYgPlkPDm4JA=h310", "https://lh4.ggpht.com/lkrE52gE4VHqLCEA5x3f1x2q4xQVRUxF2EGAQ1-GA2i6dVtL55tgimvmC3U3oThz4hU=h310", "https://lh3.ggpht.com/saF-VHbrEsM8q6TaP1SPLYBpLgO7VyzWxIkV_KdcSZwyVBfoka3usefZYfZcFeCl_g=h310", "https://lh4.ggpht.com/iRq5XlUVz_Q7lAPjAuUGxcj3HB-Mlb_ACo5nCUkf-Wv-jdZ7nqpiMazYVHa4hR4eLyer=h310", "https://lh4.ggpht.com/6x0vIVZWNi8dL2KyUOGyqetsQ3Wob7mq56KX9hfCfxE2mUy6hEt4ggWVIxQ48QGTZTs=h310", "https://lh5.ggpht.com/V1iENz6bFp2yW1BEv4LjoLIGWTqcIHaDdLFO1TAnaDj2E6qO8kEtWJNq8L8aEWVvBgk=h310", "https://lh4.ggpht.com/kUVRK-1drqyxtpy7wOsQq8wpdvhHswmOktgIw3vVgQL_x3KDep0gbYihyMrJmO1NHnE=h310", "https://lh4.ggpht.com/-nWJdZhYZmUuRQPmFFSR1_q3g3cLsqCo0le8xTbHuvnj8mNi4emvRPzmPSHah0SLdw=h310", "https://lh5.ggpht.com/k9X-ApmXybia_KvBAsarD1YWhFTHhd_Qz09oAx6Aqjr0FM9AAsYvBRHantk25nYteV5z=h310", "https://lh5.ggpht.com/YoU1YY4uKq7WqQcWKN5ZtgTMZ5p_zG4M2RRYVFGWaa472ev1AOpy_wY8CSaTXS127kw=h310", "https://lh3.ggpht.com/r8Cxm7_Ba0tZyMcfFxUEm_hyTtZdmPk6wEH7Wo-7b4wkD1VUaOLnIBqCQD0KTcV8LDOX=h310", "https://lh3.ggpht.com/V3uIdPaORvRM8I_P-2MCdbce7fI8hwOMx3BLbyTIErKG80XYEOuNapB3spsOYevjHQ=h310", "https://lh3.ggpht.com/g_pJqadyzlAOvcOZKovlT2yEzJ4Q-4_Ea7x9WG2niC5YOy6D4KiZRi6RHxCEJeDJyw=h310", "https://lh3.ggpht.com/2LTHH6RQ3nT9GiGWV8EN5YFmY8VO3X9QFdK7zsI3HSI9yWK30tmRn5284zAu6IRTwCI=h310", "https://lh6.ggpht.com/aTOlspxZ2I0-CLj8XD3Yhls522sFvyVeDOt2CWQzp31A2J0Y4virOWnMoIHxQxzakT8=h310", "https://lh6.ggpht.com/vlhNA5fudVx-F-XM_VW0Si8Faj1zqK2Xnkepb4QtGKcoLJsG3TWkstanpHt7WuiCOg=h310", "https://lh4.ggpht.com/7gdeVniu283CM_2QjTegb_hdg0CkLTnCm5d_mGjTHAEPHbgh8bWFPNoF-TW0N3aSycM=h310", "https://lh4.ggpht.com/yPHwHhmEu0CNlqzVPxV09iBt1SHy9sFxjbdv5eO135JGKvuZ9I1rwVeduI7D3AUEbXw=h310", "https://lh4.ggpht.com/8S7iha-GwoM8gGtNiLtQn-oq5kxZpTG2K_2Tsc5JFDga4MPlm4IzYuhZmP1R8WFigF-_=h310", "https://lh5.ggpht.com/YkZoON1WMSqYoh50yi52xcOP7xhc4ESeADEVDreW1Qzbytby8Es2AndhOoDpp4Sj_mc=h310"], "recommendedApps": ["com.mg.android", "com.samruston.weather", "com.devexpert.weather", "com.weather.Weather", "com.macropinch.swan", "com.exovoid.weather.app", "com.gau.go.launcherex.gowidget.weatherwidget", "com.droid27.transparentclockweather", "com.yahoo.mobile.client.android.weather", "com.accuweather.android", "com.apalon.weatherlive.free", "factory.widgets.ThreeDDigitalWeatherClock", "com.droid27.senseflipclockweather", "aplicacion.tiempo", "com.handmark.expressweather", "com.wunderground.android.weather", "com.Elecont.USARadar", "com.Elecont.Map", "com.Elecont.StockholmHostelAcco"], "ratingHistogram": {"1": "334", "3": "440", "2": "243", "5": "10,946", "4": "1,679"}, "whatsNew": "- Hurricane tracking- Alarm clock time on clock dial and graph- Weather archive for month- Weather alert categories with different sounds and silent mode at night- Send weather alerts by SMS- Solstice, Equinox, Polar night, Polar day, Solar eclipse, Lunar eclipse- Backup and restore app settings- New 10-day graph modes- Time to sunrise or sunset- Wind gust- Click on yellow and blue points for display sunset, sunrise and day length- Inverse rotation of the seconds hand for joke"}