{"videos": ["https://www.youtube.com/embed/SSzn0WSJlX0?ps=play&vq=large&rel=0&autohide=1&showinfo=0&autoplay=1"], "appName": "Weather & Clock Widget Android", "reviewers": 1513822, "refreshDate": 1428405300742, "descriptionHTML": "Weather &amp; Clock Widget for Android, the quick and accurate weather app, provides detailed weather for all cities worldwide, it searches your address and locates cities quickly, and provides the current temperature, current weather condition, humidity, pressure and wind speed and direction, in addition, five, ten days and hourly weather forecast. Weather &amp; Clock Widget for Android, is 100% free, and it comes with many cool widgets, portrait and landscape user interface.<br>Weather &amp; Clock Widget for Android comes with different widget sizes, 2x1, 4x1, 4x2 and 4x3 for normal screens, and 5x1, 5x2 and 5x3 for large screens and tablets. <br>Weather &amp; Clock Widget for Android supports a wide range of Android phones; it supports Android Version 2.3 and higher.<br>Features:<br>- Provides current weather condition and five days weather forecast<br>- 10-Day and Hourly Weather with precipitation<br>- Sunrise and Sunset time<br>- Atmospheric pressure with different units<br>- Temperature in status bar<br>- Share weather and location information with friends.<br>- Home screen widgets, 5x3, 5x2, 5x1 for large screen only and 4x3, 4x2, 4x1 and 2x1 for all screens.<br>- Searches for all cities in the world by country and city or zip code<br>- Ability to set your internet source to Wi-Fi only<br>- Ability to disable internet access from operators while you are in roaming<br>- Ability to set your preferred temperature unit, Celsius or Fahrenheit<br>- Automatic update intervals are: 1, 3, 6, 9, 12 hours and Manual update.<br>- Auto location detection<br>- Up to 10 different locations<br>- Weather map with ability to add any city to your city list<br>- Notification alerts (with option to disable it)<br>- Moon phase<br>- UV Index and Dew Point<br>- Available in: English, Dansk, Deutsch, Ελληνικά, Български, Suomi, Norsk Bokmål, Nederlands, Slovenčina, Slovenščina, Svenska, Română, العربية, كوردى, ئۇيغۇرچە, Français, Hrvatski, Türkçe, Čeština, Español, Català, Italiano, Português, Magyar, Македонски, Pусский, Українська, Қазақ тілі, Polski, Português(Brasil), Српски, Lietuvių, հայերեն, Indonesia, Việt, 日本語, 中文 (简体), 中文 (繁體), 한국어.<p>For any questions or issues, please visit FAQ page at:  <a href=\"https://www.google.com/url?q=https://www.google.com/url?q%3Dhttp://www.devexpert.net/weather%26sa%3DD%26usg%3DAFQjCNE2pD2ohKFlkWgJBgKdpg4ukVn7wg&amp;sa=D&amp;usg=AFQjCNEkNz2jwCj7_Dro0B2DrAuFSeU55g\" target=\"_blank\">http://www.devexpert.net/weather</a></p><p>* Android is a trademark of Google Inc.</p><p></p>", "logo": "https://lh3.ggpht.com/jgRxxSNZWjiG9pGQNIoE0F-9Xgn7BzvgeyCXb-55TnR7sixhfOsLStXcZLlMwPheaic=w300", "developer": "Devexpert.NET", "category": "Weather", "additionalInfo": [{"datePublished": "April 1, 2015"}, {"fileSize": "6.9M"}, {"numDownloads": "10,000,000 - 50,000,000"}, {"softwareVersion": "4.5.4.9"}, {"operatingSystems": "2.3 and up"}, {"contentRating": "Low Maturity"}], "score": "4.4", "packageID": "com.devexpert.weather", "inAppPurchases": false, "topReviews": [{"score": 3, "authorName": "Jipatia Scruggs", "reviewText": " But I'm having a problem. I have the automatic location checked so that the app can automatically display my location's weather. But it jus stays on one location. I've also added the city manually, selected it then expect it to display on my home page. But it jus stays on the original location. Even if I'm not in that location. Basically it worked for one day. What can I do before I decide to uninstall it?   ", "reviewTitle": "It's an ok app.", "reviewDate": "April 3, 2015"}, {"score": 4, "authorName": "Karl Bartlett", "reviewText": " This use to be a good app, and I mean very good, now it has stopped working, and this has happened more than once, and now it seems permanent,  The latest update started the updates working,....... lets hope this keeps up,   ", "reviewTitle": "No updates", "reviewDate": "April 2, 2015"}, {"score": 3, "authorName": "Bob Drummond", "reviewText": " Open WeatherMap and AWService are both absolute crap. Right now, AWS has the right temperature for a change, but it says that it is overcast. Open WatherMap says 5 degrees cooler and hazy. Fact: clear blue skies, not a cloud in sight. Please give us Weather Underground, they use thousands of local weather stations which are usually much more accurate.   ", "reviewTitle": "Inaccurate weather", "reviewDate": "April 4, 2015"}, {"score": 4, "authorName": "Kevin King", "reviewText": " Galaxy S4. I really do love the app. Like the layout,  widget has a ton  of options to play with. My only gripe is no multi -day forecast  for the widget (5-day  would  be  perfect ). Please add a multi -day forecast and I give it a 5-star no problem.   ", "reviewTitle": "Love it...but", "reviewDate": "April 5, 2015"}, {"score": 1, "authorName": "Leah Quintanilla", "reviewText": " The weather is hardly accurate. It shows me the weather only in 3 hour intervals. It freezes up frequently. The location isn't always right.   ", "reviewTitle": "Frustrating", "reviewDate": "April 6, 2015"}, {"score": 2, "authorName": "Lauri Grant", "reviewText": " Automatic updates have not worked  for  quite awhile, manual updates aren't much better. The new  update didn't seem to fix that issue.  Why not?  :(  Really wish it worked as well as when first installed and had AWS. I'd love to give it 5 stars again, and I will when it's updating automatically and is more accurate again. Hopefully you'll have AWS back as well. PLEASE fix this wonderful app!   ", "reviewTitle": "Manual updates might get accurate weather.", "reviewDate": "April 4, 2015"}, {"score": 1, "authorName": "Leah Forlenza", "reviewText": " I loved this app it was hands down the best weather/clock app around , one day it just stopped working and despite 3 updates still doesn't work :(   ", "reviewTitle": "was awesome now it doesn't work", "reviewDate": "April 4, 2015"}, {"score": 3, "authorName": "Chronia 慈慧仁扶安", "reviewText": " Used to be awesome. Latest update fixed some issues. Only 2 providers now, used to be more including accuweather. Accuweather been gone a while. My city listed twice for same state but list different conditions, weather and time for 5 hour forcast. Widget works fine. I.e. 5 hour forcast lists 3am & 4am for each listing when its actually 8:30 here atm. Please fix and bring back accuweather.   ", "reviewTitle": "Works better but still bugs", "reviewDate": "April 3, 2015"}, {"score": 5, "authorName": "Chris Smith", "reviewText": " Weather isn't updating as of a few updates ago. If I try to manually refresh, it just spins. **EDIT** increasing 1 star due to the quick  response from the developer. Still having the same problem, no matter which of the 2 providers I select about 80% of the time. **EDIT 3/26 ** Weather seems to be updating a bit better, but the lines between items look tacky. Get this back to how it used to be and I'll give my normal 5 star rating back. Thanks!   ", "reviewTitle": "Weather not updating", "reviewDate": "April 2, 2015"}, {"score": 3, "authorName": "Deborah Griffiths", "reviewText": " I love the look and layout, but this app never updates unless I open it and manually update. (Yes, I have checked the settings, and have tried every option.)   It is now Saturday night around 8:45, and the forecast goes from Thursday to Monday.  The widget says it's 74 outside, but 3 other weather apps all say 63. Might be removing this app soon if it doesn't start giving accurate info.   ", "reviewTitle": "Doesn't update on its own", "reviewDate": "April 4, 2015"}, {"score": 5, "authorName": "Atila Zakar", "reviewText": " The clock on desktop widget, does not show the current time after a long standby period. After manual refreshing the weather conditions, the clock is o.k. and show up the right time. Please look up for this problem.   ", "reviewTitle": "Problem with clock refresh os desktop widget", "reviewDate": "April 6, 2015"}, {"score": 2, "authorName": "D Farrell", "reviewText": " It seemed like the problem with the application not updating was fixed for a short time but after the application had an update the problem returned. Really wish it would be corrected without having to change providers. I'll give it a little more time to get fixed appropriately before I uninstall this app, as it had been one of the best weather app out there.   ", "reviewTitle": "Update Issues", "reviewDate": "April 2, 2015"}, {"score": 1, "authorName": "Kyle Lapatin", "reviewText": " I got this for the great widget. For months now the widget won't even load. The used to have another weather provider that was better. Now my options are see weather no sooner than 3 hours from now or only see updates every 3 hour (instead of every hour). I dont know what the developers did, but in about a year it went from the greatest weather app on android to one of the worst. -On Nexus 5   ", "reviewTitle": "Used To Be Great", "reviewDate": "April 2, 2015"}, {"score": 5, "authorName": "Kathy Blankenship", "reviewText": " Best weather app I have had ever. Easy to use, location is right on, well within feet. Adds are not intrusive, love that I can personalize it to my likes. :)   ", "reviewTitle": "Wonderful app", "reviewDate": "April 5, 2015"}, {"score": 2, "authorName": "Luis Fernando Barrera", "reviewText": "So sad, this used to be a great app, still the best one regarding features and layout, but at the core does not show the correct weather, after soooooo many updates.   ", "reviewTitle": "", "reviewDate": "April 4, 2015"}, {"score": 1, "authorName": "Ernesto Castro", "reviewText": " App use to be very accurate but now it doesn't update accurately before the update it was wonder now I have have to go to stock weather app cause it's horrible   ", "reviewTitle": "Was amazing but now it sucks", "reviewDate": "April 5, 2015"}, {"score": 2, "authorName": "Nicholas Acciardo III", "reviewText": " I don't understand, the only reason i downloaded this app was to be able to have a good time/weather widget, yet I can't seem to figure out HOW to actually get the widget from the app on my home screen. And no, I went to the app drawer. It's not there...   ", "reviewTitle": "Confused", "reviewDate": "April 3, 2015"}, {"score": 1, "authorName": "Mark S", "reviewText": " Don't waste your time. I just uninstalled. Could no longer keep up with location, displayed the wrong temp (like -76 in NC in March when in the 50's). Used to be OK, but something changed. Has to be something better out there.   ", "reviewTitle": "Used to work OK but just crap now", "reviewDate": "April 6, 2015"}, {"score": 1, "authorName": "Mike Latoski", "reviewText": " Had this app for a very long time and I am a very patient person but enough is enough. This hasn't worked properly in over a month even though it updated almost every day. Junk! Uninstalled and went with a program that actually works!   ", "reviewTitle": "Completely ruined", "reviewDate": "April 1, 2015"}, {"score": 1, "authorName": "Ivan Kurnosov", "reviewText": " It doesn't show the next hour forecast as it supposed to. How could you guy completely break a perfectly fine application in such a short period?  UPD: and now the location updates are broken   ", "reviewTitle": "Now widget is broken", "reviewDate": "April 6, 2015"}, {"score": 1, "authorName": "R Herd", "reviewText": " This app used to be ok now absolutely useless gps shows nowhere near where I am never updates weather and so many updates still no good. Save your self  the pain there are many better weather apps just look around   ", "reviewTitle": "It's a shame", "reviewDate": "April 4, 2015"}, {"score": 1, "authorName": "Vidya Mishra", "reviewText": " This app used to be so fantastic and accurate earlier. Now I am unable to install as I get some error code \"-24\" whenever I try to install.   ", "reviewTitle": "Bad to worse!!", "reviewDate": "April 6, 2015"}, {"score": 1, "authorName": "Youwaluk Henkel", "reviewText": " Come on.. when you repair it? Now its not working long time already.. iam bored ... wait nearly 1 month already and noughting goes..   ", "reviewTitle": "Whay you fix it broken?", "reviewDate": "April 6, 2015"}, {"score": 2, "authorName": "Karmen Skrbinek", "reviewText": " At first it was one of the best apps, but now it doesn't work. No update when I try to refresh.  Every update of this app is worse!   ", "reviewTitle": "Was good now is ruined!", "reviewDate": "April 2, 2015"}, {"score": 1, "authorName": "Darren Childers", "reviewText": " This used to be one of my absolute favorite apps, and now it's just pathetic.  It rarely updates, and even when it does the info is so horribly wrong it's useless.  It's currently 69 degrees where I live, but the app says the current temp is 46 degrees.  But I guess that's better than two days ago, when it said the temp was minus 50 degrees.  Yeah, it's really that bad now.   ", "reviewTitle": "From fantastic to horrible", "reviewDate": "April 5, 2015"}, {"score": 1, "authorName": "Jean Booth", "reviewText": " I liked most everything about this app including selection of widgets.   However,  now it freezes all the time.   I can't rely on it for anything.   Even the clock is inaccurate now, sometimes for hours.   ", "reviewTitle": "Pretty good before", "reviewDate": "April 2, 2015"}, {"score": 3, "authorName": "Robert Shapiro", "reviewText": " The unfortunate problem with free weather APIs, poor accuracy. Developer investing in a premium API (such as AccuWeather) would alleviate the problem. A premium API should be available on the paid version. Also, on the weather forecast screen, there is a horrible looking square badge under the weather icon that links to the weather provider. It is much more visible when using the dark theme. Why not just put a link at the bottom of the forecast screen for the providers instead of that eyesore of a badge?   ", "reviewTitle": "Poor Weather APIs, badge under weather icon on forecast screen looks horrible", "reviewDate": "April 2, 2015"}, {"score": 3, "authorName": "Brad Murray", "reviewText": "Seems to be back on track. Holding my breath but so far, so good.   ", "reviewTitle": "", "reviewDate": "April 5, 2015"}, {"score": 4, "authorName": "Donald Fryman", "reviewText": " Takes up a lot of space ands don't work right .the weather is on there half the time and that is why I down loaded it and that's why I'll be unloading  it . Because it don't work .I fix  problem by up date and had setting on wi_fi only . Changed that and it works great   ", "reviewTitle": "Weather & clock", "reviewDate": "April 2, 2015"}, {"score": 4, "authorName": "mike janson", "reviewText": "Aside from this app ALWAYS asking me to rate it (even AFTER I rated it) I have zero complaints! Works well, no issues!   ", "reviewTitle": "", "reviewDate": "April 4, 2015"}, {"score": 2, "authorName": "Aaron Flint", "reviewText": " I have been using it for 3 months, without fail. I see the devs tried to pull out 1 of the weather providers and it went am to hell. Maybe next time don't fix what isn't broken. It updates around 4 times a day instead of the normal hour I have it set to, and the weather is very inaccurate.   ", "reviewTitle": "App gone bad", "reviewDate": "April 4, 2015"}, {"score": 1, "authorName": "Richard Gorton", "reviewText": " I can't remember this app ever getting the weather right. For example today it said there was heavy rain forecast for most of the day when in fact there wasn't a cloud in sight all day.   This is fairly typical no matter where I am, it picks up my location well but the weather is ALWAYS wrong!   ", "reviewTitle": "Weather is a joke!", "reviewDate": "April 5, 2015"}, {"score": 2, "authorName": "Terrell Davis", "reviewText": " Way to much updates... Rarely works correctly   ", "reviewTitle": "Kind of ok app", "reviewDate": "April 5, 2015"}, {"score": 1, "authorName": "Symone Tamplin", "reviewText": " No matter how many times I refresh or update the app, the temp is always off by about 10°. Worked well in the beginning, but it's completely untrustworthy now. Even tried using different suburbs,  still didn't work.   ", "reviewTitle": "Incorrect temp", "reviewDate": "April 3, 2015"}, {"score": 5, "authorName": "Cristian Coman", "reviewText": " The app it is not updating data as it used to do before (on any weather provider).   ", "reviewTitle": "Latest version are such a mess", "reviewDate": "April 1, 2015"}, {"score": 2, "authorName": "David Bridges", "reviewText": " What the heck is wrong with this app? it will not update at all. Used to b the best weather app hands down an now it's garbage. Please repair asap!   ", "reviewTitle": "Fix now!", "reviewDate": "April 2, 2015"}, {"score": 2, "authorName": "Richard Fitzwater", "reviewText": " It formerly was my favorite weather app & widget.  Unfortunately it has stopped performing auto and manual updates. Uninstalled and reinstalled a few times and the problem persists. Had to install another app which works properly.   ", "reviewTitle": "Stopped updating", "reviewDate": "April 6, 2015"}, {"score": 1, "authorName": "Ahmad SAMADI", "reviewText": " Since three days completely wrong information in United Kingdom. I think now we have to remove this app forever. Because we waited long time for it and still is on our home page of mobile phones.   ", "reviewTitle": "Wrong weather  information", "reviewDate": "April 6, 2015"}, {"score": 3, "authorName": "Tim Wood", "reviewText": " EDIT 06/04/15, working ok again now, weather not as accurate as AWService for me in UK but ok, best weather widget.EDIT 3/04, last update seems to have fixed updating weather and widgets. If the devs are reading I suggest looking at the wifi/mobile roaming transition as this is when it seems to stop working. It was great and others could learn a lot from the mass of widget options and customisation, but all that is lost when it fails to update. I did notice that the ads seem to always work ;-) just saying!   ", "reviewTitle": "Was the best, now not sure", "reviewDate": "April 6, 2015"}, {"score": 4, "authorName": "John Warrick", "reviewText": " Getting back on track, keep up the good work   ", "reviewTitle": "Great app, but...", "reviewDate": "April 3, 2015"}], "description": "Weather & Clock Widget for Android, the quick and accurate weather app, provides detailed weather for all cities worldwide, it searches your address and locates cities quickly, and provides the current temperature, current weather condition, humidity, pressure and wind speed and direction, in addition, five, ten days and hourly weather forecast. Weather & Clock Widget for Android, is 100% free, and it comes with many cool widgets, portrait and landscape user interface.Weather & Clock Widget for Android comes with different widget sizes, 2x1, 4x1, 4x2 and 4x3 for normal screens, and 5x1, 5x2 and 5x3 for large screens and tablets. Weather & Clock Widget for Android supports a wide range of Android phones; it supports Android Version 2.3 and higher.Features:- Provides current weather condition and five days weather forecast- 10-Day and Hourly Weather with precipitation- Sunrise and Sunset time- Atmospheric pressure with different units- Temperature in status bar- Share weather and location information with friends.- Home screen widgets, 5x3, 5x2, 5x1 for large screen only and 4x3, 4x2, 4x1 and 2x1 for all screens.- Searches for all cities in the world by country and city or zip code- Ability to set your internet source to Wi-Fi only- Ability to disable internet access from operators while you are in roaming- Ability to set your preferred temperature unit, Celsius or Fahrenheit- Automatic update intervals are: 1, 3, 6, 9, 12 hours and Manual update.- Auto location detection- Up to 10 different locations- Weather map with ability to add any city to your city list- Notification alerts (with option to disable it)- Moon phase- UV Index and Dew Point- Available in: English, Dansk, Deutsch, Ελληνικά, Български, Suomi, Norsk Bokmål, Nederlands, Slovenčina, Slovenščina, Svenska, Română, العربية, كوردى, ئۇيغۇرچە, Français, Hrvatski, Türkçe, Čeština, Español, Català, Italiano, Português, Magyar, Македонски, Pусский, Українська, Қазақ тілі, Polski, Português(Brasil), Српски, Lietuvių, հայերեն, Indonesia, Việt, 日本語, 中文 (简体), 中文 (繁體), 한국어.For any questions or issues, please visit FAQ page at:  http://www.devexpert.net/weather* Android is a trademark of Google Inc.", "whatsNewHTML": " <h1 class=\"heading\"> What's New </h1> <div class=\"recent-change\">FAQ page at: http://www.devexpert.net/weather</div><div class=\"recent-change\">---</div><div class=\"recent-change\">If you are facing weather update problems, please be informed that this due to high traffic that app generates on our providers, and we do many updates for minimizing the load, you may change provider from settings &gt; weather providers, and we were in process to add more providers since few weeks and it will take more few days, we appreciate your patience and support.</div> <div class=\"show-more-end\"></div> <div> <button class=\"play-button show-more small\"> Read more </button> <button class=\"play-button expand-close\"> <div class=\"close-image\"> </div> </button> </div> ", "price": "free", "playStoreUrl": "https://play.google.com/store/apps/details?id=com.devexpert.weather", "permissions": [], "thumbnails": ["https://lh6.ggpht.com/hL1tSQ2Sz_gj0YWMniDynj7O7OxDyovx6al000ld1nTBxzw3hlXW2W957x8iEhKIqgfO=h310", "https://lh3.ggpht.com/AstcjUxh2fmEdy7nTGvx5uR9ObyFI41kqvCvlWkc3gPAaesst1imiNUe_8cj8C6ljos=h310", "https://lh5.ggpht.com/FzRBNuCu7j_bGkGgQijWwVn-0KABaATgsA3-MtwD2aDiGO-jvCv54MJ9auHSMjO2aQ=h310", "https://lh6.ggpht.com/44LFks5eFgcpCkjyKOSeqT-rhPdDP4f3GZdl5f1K8_Ci88CiDoIq5xL0ZcJalykdkag=h310", "https://lh4.ggpht.com/hxfA6KiQn725d_aZmbH7F9LM2i9ZV_VrFx9pkDIKbI7C4lwc9kCYG8gCbAGZ9REDqjc=h310", "https://lh4.ggpht.com/mfhcrlakc9p75_GT-kS7QB_mxi4XSF7bmfFBL26uJxexJF8EN9Ae2H9_QrRvEanNeVhs=h310", "https://lh4.ggpht.com/7OPu9sFHVq41gNV_aboNnsfa5lpCtpzvbVKkR6HMnjGw1rQYxVagXzUe6lGWeexjFg=h310", "https://lh6.ggpht.com/4LLoeHUdiZ_bZPILL4hWJKiZXCzvPdEIOtkv6l6E3D8u4Xb7hhGllahX5vS68Qa_nvsp=h310"], "recommendedApps": ["com.droid27.transparentclockweather", "com.macropinch.swan", "com.accuweather.android", "com.exovoid.weather.app", "com.weather.Weather", "com.yahoo.mobile.client.android.weather", "aplicacion.tiempo", "factory.widgets.ThreeDDigitalWeatherClock", "com.aws.android", "com.accurate.weather.widget", "com.droid27.senseflipclockweather", "mobi.infolife.ezweather.widget.oxygen", "com.apalon.weatherlive.free", "ru.yandex.weatherplugin", "com.gismeteo.client", "com.handmark.expressweather", "com.devexpert.weatheradfree", "com.devexpert.batterytools"], "ratingHistogram": {"1": "61,008", "3": "116,679", "2": "37,816", "5": "911,399", "4": "386,919"}, "whatsNew": "FAQ page at: http://www.devexpert.net/weather---If you are facing weather update problems, please be informed that this due to high traffic that app generates on our providers, and we do many updates for minimizing the load, you may change provider from settings > weather providers, and we were in process to add more providers since few weeks and it will take more few days, we appreciate your patience and support."}