{"videos": ["https://www.youtube.com/embed/XZf2mCHZoTs?ps=play&vq=large&rel=0&autohide=1&showinfo=0&autoplay=1"], "appName": "Transparent clock & weather", "reviewers": 209253, "refreshDate": 1428315572703, "descriptionHTML": "Transparent clock &amp; world weather is a full featured, completely customizable digital clock and weather forecast application and widget.<p>The application features the following:</p><p>- Many widgets in different sizes (4x1, 4x2, 4x3 and 5x2)<br>- Several widget skins to choose from<br>- Different weather icon skins<br>- Different fonts for the time<br>- Display the next alarm, next calendar event and week number on the widget (optional)<br>- Several widget hotspots (most of them can be user defined to launch specific applications)<br>- Automatic location (from cell/wifi or GPS) or manual<br>- Automatic weather update interval (15 min, 30 min, 1, 2, 4, 6, 8 hours) or manual<br>- Detailed current weather forecast display that includes the following:<br>- Local time (for current location)<br>- Sunrise and sunset time for current location<br>- Humidity, pressure, chance of rain, dew point, visibility, UV index and wind conditions<br>- Current condition, temperature, low and high temperatures<br>- Last weather update time<br>- Background according to the weather condition and day/night<br>- Optional display of the current moon phase<br>- 24 hourly weather forecast<br>- 24 hourly wind forecast<br>- 7 day future forecast<br>- Moon information and 30 day moon phase calendar<br>- Future forecast details (sunrise, sunset, moon phase, wind, humidity and chance of rain<br>- World weather: Choose to display weather information for any number of different locations worldwide</p><p>The application is localized in the following languages:</p><p>The application is localized in the following languages:</p><p>Afrikaans, ‎العربية‎, български, Català, 中文 (简体), 中文 (繁體), Hrvatski, Čeština, Dansk, Nederlands, Suomi, Français, Deutsch, Ελληνικά, , ‎עברית‎, Magyar, Bahasa Indonesia, Italiano, 한국어, Lietuvių, македонски, Polski, Português (Brazil), Português (Portugal), Română, русский, Српски (Ћирилица), Srpski (Latinica), Slovenčina, Español (Spain), Svenska, ไทย, Türkçe, Українська, Tiếng Việt</p><p>Please report any problems, suggestions or requests by e-mail.</p><p></p><p></p><p></p><p></p><p></p>", "logo": "https://lh4.ggpht.com/3_N4I5rQCen_4_I4LJZrUt19QWG284vigNxQE1vxszl7oC8P0eTP6dZfDDVDAT5vJQ=w300", "developer": "Droid27", "category": "Weather", "additionalInfo": [{"datePublished": "March 30, 2015"}, {"fileSize": "15M"}, {"numDownloads": "10,000,000 - 50,000,000"}, {"softwareVersion": "0.84.47"}, {"operatingSystems": "2.3 and up"}, {"contentRating": "Low Maturity"}], "score": "4.2", "packageID": "com.droid27.transparentclockweather", "inAppPurchases": false, "topReviews": [{"score": 2, "authorName": "Linda Redmond", "reviewText": " It's my favorite weather widget, but I'll have to uninstall. I've tried everything I know of to correct it, and have retraced my steps in settings, but even though it has my city correct and appears I have all settings set up correctly, the OpenWeather source is totally inaccurate. Hopefully this will get fixed and I can try it again later.   ", "reviewTitle": "Temperature & forecast are off by 20-40 degrees.", "reviewDate": "April 5, 2015"}, {"score": 5, "authorName": "steve roche", "reviewText": " Work's great. Awesome.. Thank you for the bug fixes back on track..   ", "reviewTitle": "Awesome", "reviewDate": "April 1, 2015"}, {"score": 3, "authorName": "Ayman Abu Kraiem", "reviewText": " Really like it but few things need fixing. First, temperature is not accurate, it's 5 degrees Celsius above my Xperia Z1 stock weather app & even Google news. Second, widget doesn't have a switch for multiple locations.  Third,  hour font bolder than minute NOT working on the widget.   ", "reviewTitle": "Nice but", "reviewDate": "April 3, 2015"}, {"score": 5, "authorName": "Michael Steklac", "reviewText": " Not only does this provide a clock and weather, it shows various metrics about storage space, RAM,  WiFi strength, etc.   ", "reviewTitle": "Only widget with Phone Metrics", "reviewDate": "April 4, 2015"}, {"score": 4, "authorName": "Mike and Marlene", "reviewText": "Wish it had Open Weather Map provider as well,  its dead on I'm my area,  Weather underground is way off,   Your htc sense widgets with open weather map report perfect but I like the look of this app better.   ", "reviewTitle": "", "reviewDate": "March 30, 2015"}, {"score": 3, "authorName": "Rik Morel", "reviewText": " It says its been raining most of the day. It hadn't rained all day. Can't seem to find where it's getting or updating / not updating the information from. It should be easier to change the source to something better and more accurate.  The interface has decent options and looks good..... If there isn't any improvement on the weather part then this will be uninstalled for being somewhat unreliable. I give iit a 4/5 for look and a 2.5/5 for performance.this may change. We'll see.   ", "reviewTitle": "Weather is buggy", "reviewDate": "March 31, 2015"}, {"score": 4, "authorName": "Dimitar Paskov", "reviewText": " The widget is pretty and customizable. I just have couple of things missing - ability to show the feels like temperature instead of hi/low and ability to make the date font larger. Add these and I will gladly give you 5 stars. Keep up the good work.   ", "reviewTitle": "Good weather widget", "reviewDate": "March 31, 2015"}, {"score": 4, "authorName": "Oliver Ong", "reviewText": " Have been using this app for about a year and a half without any problems. Customized it just the way I wanted. Great app... Have been getting server connection error in the last 3 weeks, but now resolved. Thanks.   ", "reviewTitle": "Great app", "reviewDate": "April 5, 2015"}, {"score": 2, "authorName": "Annie48 Annie", "reviewText": " I am in Ireland and since the clocks went forward last weekend the sunrise and sunset times are an hour behind. I cannot update them. Also every time I try to put in my exact location where I live, rather than the city I live in, the whole time on screen and location changes. Again can't change this.Very frustrating when it could be a very good app and easily fixed. Any hope that you can fix these problems soon?  No point in offering an app to customers that doesn't work properly!  Not very professional!   ", "reviewTitle": "Sunrise and sunset and location", "reviewDate": "March 31, 2015"}, {"score": 4, "authorName": "Bobby B", "reviewText": "At last weather accuracy is back on track with WU provider! Now please fix weather autoupdate in preset intervals and when phone wakes up.   ", "reviewTitle": "", "reviewDate": "April 2, 2015"}, {"score": 4, "authorName": "Elijah Aberdeen", "reviewText": " Why does the next event always state the day as one day before the actual date. For example on my phone calender, the reminders are holidays and this app states those holidays as occurring one day before they actually happen. I sort of understand the logic but I would like the option to have my reminders state the exact date.   ", "reviewTitle": "Error??", "reviewDate": "March 31, 2015"}, {"score": 3, "authorName": "Geoff Lichy", "reviewText": " Someone deleted my reviews multiple times, which simply pointed out that the app was not 100% functional for some time. Which was true. Weather would not refresh, widget was buggy, etc. Currently it SEEMS like they have fixed these issues. The app works again. I'm hoping they weren't the ones who deleted my reviews, because that would be incredibly dishonest and would prompt me to uninstall this. That would be a shame, because when I first installed this it was easily 4.5/5 stars (aside from the ads).   ", "reviewTitle": "App kind of works", "reviewDate": "April 5, 2015"}, {"score": 2, "authorName": "Bryson Howell", "reviewText": "I am so sick of this f'ing app.  It rarely updates now AND it feels the need to change my default location to a different location (Can't delete default location either).  Fix this! Edit: Great, that's been fixed.  Now if only the widget will actually reflect the change in weather after I refresh.  AND, I have this set to refresh hourly, yet, when I went into the app, it hadn't updated for nearly 3 hours!   ", "reviewTitle": "", "reviewDate": "March 31, 2015"}, {"score": 3, "authorName": "Russell Bergman", "reviewText": " Nice app but the weather is totally inaccurate.  It shows 'light rain ' for the locations around the world that I have selected,  as well as my current location.   ", "reviewTitle": "Weather is wrong!", "reviewDate": "April 1, 2015"}, {"score": 4, "authorName": "Scott Therrien", "reviewText": " Looks like the developers have addressed some of the server issues of late. Seems to be working well.   ", "reviewTitle": "Nice to have on home screen", "reviewDate": "April 1, 2015"}, {"score": 4, "authorName": "Don Schaaf", "reviewText": " Great app. other than time is always freezing.  Sometimes clearing cache corrects problem.  2-3 times a week I have to remove widget and then put back.  I have a Note 4.   ", "reviewTitle": "Time Freeze problem", "reviewDate": "March 30, 2015"}, {"score": 4, "authorName": "Enamul Hoque", "reviewText": " Pls add chance of rain, weather display at notification bar. When we use it widgets pls add show sunrise & sunset also add manual refresh.   ", "reviewTitle": "add add", "reviewDate": "April 1, 2015"}, {"score": 4, "authorName": "Alexander Irizarry", "reviewText": " How come everytime tge app gives me weather from Morelia Mexico? I mean I live in Canada what do i need th3 weather from Mexico for?   ", "reviewTitle": "Good app but...", "reviewDate": "April 2, 2015"}, {"score": 4, "authorName": "Artis Albrekts", "reviewText": "App was missing a few hours of weather and showed N/A. Open weathermap was pretty precise in my aeria (EU), hope new provider wont be bad. Auto refresh not always working.   ", "reviewTitle": "", "reviewDate": "April 4, 2015"}, {"score": 2, "authorName": "jim voet", "reviewText": " Used to update on the time span specified, even on the lock screen. Now, have to open the app to get the weather to update. Rather useless that way   ", "reviewTitle": "Behind", "reviewDate": "April 2, 2015"}, {"score": 1, "authorName": "John Small", "reviewText": " Update2: All TCW widgets have disappeared after recent update. I use Nexus 5 android v 5.1. Widgets are the only reason to use this app, if they are gone there is no point to it.   ", "reviewTitle": "I like it but...", "reviewDate": "March 30, 2015"}, {"score": 2, "authorName": "Ronald Dickman", "reviewText": " Since the last 2 updates it has stopped using my location and is showing 20 miles away. Also won't change to new locations, un/reinstalled x2 but still not working,   ", "reviewTitle": "Is now useless", "reviewDate": "March 31, 2015"}, {"score": 1, "authorName": "Nicole N", "reviewText": " I don't understand why you can't get this fixed and working accurately. It used to work wonderfully and ever since DST you can't get it to work consistently. The weather is inaccurate, doesn't update (unless manually),and the weekly forecast is way off from what The Weather Channel is showing and IT'S ACCURATE. Location does allow you to indicate the state. I'm back to uninstalling until you can get it back to the way it was. I only reinstalled bc recent reviews would have you believe its working great.   ", "reviewTitle": "STILL not working!", "reviewDate": "April 2, 2015"}, {"score": 1, "authorName": "Mike Lee", "reviewText": " attempt to make a us based app work for the rest of the world. Currently in the teeth of 60mph gales, app says 'gentle breeze'. Going, going.... Gone!   ", "reviewTitle": "Irrelevant - this is another poor", "reviewDate": "March 30, 2015"}, {"score": 4, "authorName": "Sylvia Ramsay", "reviewText": "Seems as accurate as a newspaper forecast. Initially a few issues working out how to get weather in local city in Queensland, Australia not America but now is good.   ", "reviewTitle": "", "reviewDate": "April 3, 2015"}, {"score": 4, "authorName": "Lindsay Aceto", "reviewText": " Great now that bugs were fixed. Wish weather was a bit more accurate...   ", "reviewTitle": "Daylight savings", "reviewDate": "April 1, 2015"}, {"score": 5, "authorName": "Sudhakar Reddy", "reviewText": " Accurate and fantastic and also perfect   ", "reviewTitle": "Very good accuracy", "reviewDate": "April 1, 2015"}, {"score": 5, "authorName": "George Matthews", "reviewText": " Before ... would need to reboot to update, everyday, now rarely.   ", "reviewTitle": "Update helped with updating...", "reviewDate": "April 3, 2015"}, {"score": 4, "authorName": "Duncan Houston", "reviewText": " I was looking for something pretty and informative - this fit the bill nicely.  I would like to be able to change the colour of the next calendar event, so it is different from the current day/date but otherwise it's great.   ", "reviewTitle": "Very functional", "reviewDate": "March 31, 2015"}, {"score": 4, "authorName": "Brian Gomes", "reviewText": " One of the best weather clocks out there with lots of options!   ", "reviewTitle": "I like the display.", "reviewDate": "April 4, 2015"}, {"score": 5, "authorName": "Rick Mitchell", "reviewText": " This is the best clock and weather app! I have tried many other apps this is the best one I have found. It is very customizable.They've been having a few problems lately but the last 2 updates I have gotten have solved any problems I had. If anything goes wrong they work hard to fix it quickly. Thanks guys you really nailed this one!   ", "reviewTitle": "Great clock and weather app!", "reviewDate": "April 1, 2015"}, {"score": 3, "authorName": "Chris S in SC", "reviewText": " The forecasts you give change by the minute.  At 10am, you forecast clear with 90deg high. Then, one hour later it's drizzling and the high is 68...wtheck?   ", "reviewTitle": "Changes forecast", "reviewDate": "April 4, 2015"}, {"score": 5, "authorName": "JasminBlue Montano", "reviewText": " Awesome app I have a few weather /clock apps and widgets and this one is so detailed and precise as well as visually nice.   ", "reviewTitle": "HTC transparent clock", "reviewDate": "April 3, 2015"}, {"score": 5, "authorName": "Tim Wood", "reviewText": " This weather app and widget has all you could want and more, excellent. All the stuff I want on a widget and the weather updates work. After my previous fave weather app was broken by a dozen updates I tried 20 more and this is THE one! Thank you.   ", "reviewTitle": "Glad I found this app, all you could want and more", "reviewDate": "March 31, 2015"}, {"score": 3, "authorName": "Teddy Nextroff", "reviewText": " Not all the settings can be accessed so I cannot customize everything.   ", "reviewTitle": "problems on Nexus 10 Lollipop 5.1 stock", "reviewDate": "April 4, 2015"}, {"score": 4, "authorName": "Fady Ghaly", "reviewText": " I'd like to see sunrise and sunset times on the widget if possible. Also, even when I unchecked the \"moon phases\" option in the settings it still shows on the widget. Doesn't offer the most beautiful graphics, honestly, but is clean, useful and stable. If it's still stable and accurate after a couple of weeks and you give us sun times on widget I'll rate 5/5. Using Samsung Galaxy Note 3 SM-N9005 and Note 10.1 2014 SM-P601 both on Android 4.4.2   ", "reviewTitle": "So far so good", "reviewDate": "March 31, 2015"}, {"score": 3, "authorName": "Barbara Romanowski", "reviewText": " Would be 5/5 if it had a hourly weather widget without the clock (4x1).   ", "reviewTitle": "Almost perfect", "reviewDate": "March 31, 2015"}, {"score": 5, "authorName": "duckie finch", "reviewText": " No more weather on widget. Used to work and is or was my favorite widget for time, weather, and access to my alarm. Please fix soon. I hope yall are getting these concerns.   ", "reviewTitle": "No Weather", "reviewDate": "March 30, 2015"}, {"score": 5, "authorName": "Darren Fuller", "reviewText": " Time stalls on 5.0.1 not sure if its my phone or the app! Still the best if its kind though   ", "reviewTitle": "Great", "reviewDate": "March 30, 2015"}, {"score": 4, "authorName": "Michelle Tilley", "reviewText": " Humidity has read 100%for over 1 week now. I know it's not that high. ???   ", "reviewTitle": "Reasonable app.", "reviewDate": "April 5, 2015"}], "description": "Transparent clock & world weather is a full featured, completely customizable digital clock and weather forecast application and widget.The application features the following:- Many widgets in different sizes (4x1, 4x2, 4x3 and 5x2)- Several widget skins to choose from- Different weather icon skins- Different fonts for the time- Display the next alarm, next calendar event and week number on the widget (optional)- Several widget hotspots (most of them can be user defined to launch specific applications)- Automatic location (from cell/wifi or GPS) or manual- Automatic weather update interval (15 min, 30 min, 1, 2, 4, 6, 8 hours) or manual- Detailed current weather forecast display that includes the following:- Local time (for current location)- Sunrise and sunset time for current location- Humidity, pressure, chance of rain, dew point, visibility, UV index and wind conditions- Current condition, temperature, low and high temperatures- Last weather update time- Background according to the weather condition and day/night- Optional display of the current moon phase- 24 hourly weather forecast- 24 hourly wind forecast- 7 day future forecast- Moon information and 30 day moon phase calendar- Future forecast details (sunrise, sunset, moon phase, wind, humidity and chance of rain- World weather: Choose to display weather information for any number of different locations worldwideThe application is localized in the following languages:The application is localized in the following languages:Afrikaans, ‎العربية‎, български, Català, 中文 (简体), 中文 (繁體), Hrvatski, Čeština, Dansk, Nederlands, Suomi, Français, Deutsch, Ελληνικά, , ‎עברית‎, Magyar, Bahasa Indonesia, Italiano, 한국어, Lietuvių, македонски, Polski, Português (Brazil), Português (Portugal), Română, русский, Српски (Ћирилица), Srpski (Latinica), Slovenčina, Español (Spain), Svenska, ไทย, Türkçe, Українська, Tiếng ViệtPlease report any problems, suggestions or requests by e-mail.", "whatsNewHTML": " <h1 class=\"heading\"> What's New </h1> <div class=\"recent-change\">Version 0.84.47</div><div class=\"recent-change\">- [fix] Bug fixes</div> <div class=\"show-more-end\"></div> <div> <button class=\"play-button show-more small\"> Read more </button> <button class=\"play-button expand-close\"> <div class=\"close-image\"> </div> </button> </div> ", "price": "free", "playStoreUrl": "https://play.google.com/store/apps/details?id=com.droid27.transparentclockweather", "permissions": [], "thumbnails": ["https://lh4.ggpht.com/eLhfk762FFTlkWNal0zG1ZivdS5xeyRW656qwoEPXMW_7m1BF5Wdg98SnxW_aDwg6_s=h310", "https://lh5.ggpht.com/FZR8o6ETYUeHerWnGLEfudAspGNBJoqcY_DNhFcz9JEOVgEtOZU51txfyJGvvP0GKc8=h310", "https://lh6.ggpht.com/L_GEPKHFZEEDda1YEt0IE3PsYbJ7RD7_upnWo3MgFQFQ8g9NHwAZLUVFvruD8z8kWw=h310", "https://lh5.ggpht.com/vaTkNzYnukRWny-vrlma8dAfploZABYCrZqAgU0Rcw1nZxDfJ5V0A6fOvhPw6plodvE=h310", "https://lh3.ggpht.com/t8P_Fm1wDRfA0d2jfvNeOwF7AVQewznrPmrF2zOP5c9fltts7KqHgdnqZIeHm3K4dK8=h310", "https://lh5.ggpht.com/ArQrZ3tgILpwVf7jcYcsQdFALRIwr5-hi9dWaUT97T7fWdtZdyM8m9cAYCDIh7jVDw=h310", "https://lh4.ggpht.com/q1ASa0gsrK8OO3CJ5CNu5iDbPJB_W6eT1sv49ngOBFpzqwiJAwEKEjPBwbkPFsTFJA=h310", "https://lh5.ggpht.com/lMH5aZVlrp1ZOiODuSMRWHnAXC_FQNd2uJyixBSNoWaRC-7dGVW7PZXLKCCUob_t8xY=h310", "https://lh4.ggpht.com/ISjOXhVYrz8VJLKkTv1OPx2XVn1UlXQuLAiwCS8g1Ao9KxrbRgs3isSmgz00B9yQvLU=h310", "https://lh4.ggpht.com/D4WWOBqpdcE2HlpTYGMSP0lCtbXCv59TCCcbgaeoF3fk-1R2AqdGwMRn2J4kgbz3LTU=h310", "https://lh3.ggpht.com/Q8RUOeU55034w5nq77MVJPHilTrpjXBiBzm1mPt70lIR7oTiV5hiJvttjrFVpL9Y0Cwv=h310", "https://lh3.ggpht.com/sthGHvSkb6M5IFch88CPpEpAu6Ilpicx-Chg246swVoYTTAiNV4k5FHQXORGhvbpOtUZ=h310", "https://lh5.ggpht.com/dJZFx7gqeebEFapLDVoKN3hOCMSjG4lWXqN65BXVYcgvVGZAtrwau4IIZQX9NEYvMHQ=h310", "https://lh5.ggpht.com/1pV1XpMt5i-ZaObePZ1uYs-58zjEceQvZTHXOxWbbAxvuwvxxWXBpjPbB7sKo5MshBc=h310", "https://lh6.ggpht.com/xIR5a-K2lNDzDMT7CG2Fb7AIm1Q2P-0Duq8X7ieCLHwyHhzd2MD2ZndZh7ICuywo6uY=h310", "https://lh4.ggpht.com/coAIEeGO2sInf2GJQLuHOxGPL6EvfAe-KJ8gFXjXTM-IZ72AKVZEQaLTpPeWCgMn5C8=h310", "https://lh3.ggpht.com/Z9767FsX9KdfWHlxAyhYTQfs82MN22qigZfV2jmS-3NLoDY8WmuWn0n-MOgKXZMc1Hw=h310", "https://lh5.ggpht.com/1G-ojwTqeWVIb9X7zqe3o2rrWspynKQvbO4arCWbtIXleWEFe_i4R-JhrZe8oWxt3A=h310", "https://lh3.ggpht.com/nSt9ihNgwOH9geQxpJ6wxyzjHk19KG7oUTpSmbel_oVOQyAL3N3h0yKNKrtIoZGUup4=h310", "https://lh4.ggpht.com/0zK2o1fHsUjLNLW3bwimMhLOPmXmBK4ueWHD59j6HSR0gtZ8S4Lb3xtBrRmL_nE-ZGM=h310", "https://lh6.ggpht.com/RGTbOfd0TtudpPt7Ov3VEYloxyIvBHH-ucu3c0xpXn26AC6O4mx4CT_q71AIvx6c-1Y=h310", "https://lh3.ggpht.com/FE-0fyM4vE8iuP7Q7Kdkfzeg4MtKVGG5bUv8uTHtcr3F3l4_8mrhwyDFB3HYtJ53MLI=h310", "https://lh4.ggpht.com/725eqUPzpsHMt3w1p0F1ydTa-ZjP9l8sxmt888wj2AZGSJy0xCaojS8-a0OqKjxkQyHZ=h310", "https://lh6.ggpht.com/L87LhrR0uIQUnSpmviamE6cWe8SHbfITt3wR7iS78vySzxpvjTSZCSMmp-gmOCrySh4=h310"], "recommendedApps": ["com.devexpert.weather", "com.accuweather.android", "com.macropinch.swan", "com.exovoid.weather.app", "com.yahoo.mobile.client.android.weather", "factory.widgets.ThreeDDigitalWeatherClock", "com.weather.Weather", "aplicacion.tiempo", "com.apalon.weatherlive.free", "com.aws.android", "com.accurate.weather.widget", "mobi.infolife.ezweather.widget.oxygen", "com.handmark.expressweather", "com.tennumbers.animatedwidgetsfree", "com.gau.go.launcherex.gowidget.weatherwidget", "ru.yandex.weatherplugin", "com.droid27.senseflipclockweather", "com.droid27.digitalclockweather", "com.droid27.sensev2flipclockweather", "com.droid27.d3flipclockweather", "com.droid27.digitalclockweather.theme01", "com.droid27.d3flipclockweather.theme02", "com.droid27.d3flipclockweather.theme01", "com.droid27.wallpapers.hd.patriotic.usa", "com.droid27.d3flipclockweather.theme04", "com.droid27.d3senseclockweather", "com.droid27.worldclockweather", "com.droid27.d3flipclockweather.theme06", "com.droid27.d3flipclockweather.theme03", "com.droid27.d3flipclockweather.theme05", "com.droid27.wallpapers.hd.patterns.bw", "com.droid27.wallpapers.halloween"], "ratingHistogram": {"1": "11,410", "3": "18,831", "2": "7,756", "5": "117,666", "4": "53,590"}, "whatsNew": "Version 0.84.47- [fix] Bug fixes"}